[
    {
        "Name": "Obtaining an Official Company Extract from the South African Registry",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Obtaining-Official-Company-Extract-from-the-South-African-Registry_~021895069510526814051/?referrer_url_path=/nx/search/jobs/",
        "Task": "Hello,\nI am looking for a researcher to obtain an official company extract from the South African company registry to find details about its shareholders and board of Directors.\n\nThanks,\nErik",
        "Skills_Expertise": " Company Research "
    },
    {
        "Name": "Web Scraping specialist - data needed",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-specialist-span-class-highlight-data-span-needed_~021895069089806095149/?referrer_url_path=/nx/search/jobs/",
        "Task": "I need a dataset for an initial MVP validation.  \n\nThe data would come from scraping reddit, google maps reviews (and ratings),  yelp, facebook groups and other websites.\n\nI would prefer to work with someone who would be willing to be involved for longer, possibly be added to the team.\n\nMy tech stack will be using JS (node, react) primarily.",
        "Skills_Expertise": " Data ExtractionData ScrapingData EngineeringData CollectionData MiningScreen ScrapingWeb Scraping PluginWeb Scraping FrameworkWeb ScrapingETLWeb CrawlingWeb Scraping SoftwareDexi.ioAutomationChatGPT "
    },
    {
        "Name": "Need to run a script both online (with internet) and offline (without internet) as well",
        "Fixed_price": "Est. budget: $325.00",
        "Url": "https://www.upwork.com/jobs/Need-run-script-both-online-with-internet-and-offline-without-internet-well_~021895069020707604323/?referrer_url_path=/nx/search/jobs/",
        "Task": "Do you have any experience with offline apps then the work is for you . \n\nWork Details : The work will run offline in Mobile or Tablet without internet connection, and when internet connection is restored, the work will automatically sync to the database with the relevant details. \n\n\n\nI need to run a script both online (with internet) and offline (without internet) as well. \n\n\n\nTo run offline, the following tasks are needed: \n\nThere are a few employees who work outside and they fill out the work reports using a tablet with the help of internet .Our backend system contains a large number of customers, a few employees, and a number of locations. We may create new customers or tasks every day. All those details should be automatically synced when the tablet is online and saved to the tablet's local storage for offline work. After the work is completed, all the data in the local storage should be moved to a database when the tablet is connected to the internet. this is the work flow that I needed. \n\n\nCurrently, I am using the online method for my tablet and that script is done in Laravel . There is no internet access at many of the locations. That's why I'm considering Offline.",
        "Skills_Expertise": " Mobile App DevelopmentLaravelPHPPythonJavaScript "
    },
    {
        "Name": "Cleanup and add 2 new features to our node-based chrome extension",
        "Fixed_price": "Est. budget: $200.00",
        "Url": "https://www.upwork.com/jobs/Cleanup-and-add-new-features-our-node-based-chrome-extension_~021895065829935778567/?referrer_url_path=/nx/search/jobs/",
        "Task": "I have an existing Chrome extension. This chrome extension today provides an integration between my SaaS app, and the user's browser to allow us to copy cookies for automation, etc. \n\nThis Chrome extension part works OK. But, it needs a bit of a UX cleanup. It's in Dark mode only (I think), and the color palette used by the original developer isn't very good. (not higher contrast). So, this needs to be fixed.\n\nBefore we had the Plugin, we had Javascript bookmarklets that would let people scrape certain things out of their social accounts and paste them into spreadsheets.  This allowed us to accelerate and simplify some project management tasks. \n\nI'd like to \"take the next step\" with this, and integrate these bookmarklets into the chrome extension. \n\nBy doing so, you'll also need to do a small integration with our API. You'll:\n\n1) need to query our API for a list of destinations available for the data from the bookmarklets. \n2) You will give the user of the Chrome extension the ability to select their destination endpoint. \n3) You will need to modify the bookmarkets to push the data into these destination endpoints.\n4) You will need to ensure you can report on the status on the extension.\n\nI'd like to move on this quickly and get this functionality into our extension sooner rather than later. \n\nTo be considered, please reply and tell me your experience with extensions like this, scraping in general, and your favorite fruit and why.",
        "Skills_Expertise": " Google Chrome ExtensionJavaScriptNode.jsCSSAPI "
    },
    {
        "Name": "Amazon & Noon Saudi Product Research Specialist Needed",
        "Fixed_price": "Est. budget: $2,500.00",
        "Url": "https://www.upwork.com/jobs/Amazon-Noon-Saudi-Product-Research-Specialist-Needed_~021895065441397622627/?referrer_url_path=/nx/search/jobs/",
        "Task": "This is a research project (not commercial) for an economics purpose. \n\nI am looking for someone who is able to use Amazon Seller partner API to call on product research for current listings within Amazon SA and Noon (for the Saudi market). The idea is similar to create an online dashboard for all items similar to the Competitive Intelligence tool at JungleScout, that is currently only available for the US market - while the use is mostly for amazon seller this one is more about data gathering and many elements there is not needed, and since it not currently offered for many markets may require data aggregation knowledge since it will have to be linked to the keywords in the Haramonized HS code excel sheet (see attached list)\n\n\"https://www.junglescout.com/features/amazon-competitive-intelligence-tool/\" \n\nThe output is a dashboard which contain market analysis, price trends, total demand at the product level (not store or seller level). This could be done through amazon scout (amazon scout works in Saudi but not fully for all products) as such potentially this may need separate and tailored API calling",
        "Skills_Expertise": " Data ExtractionData ScrapingData IntegrationWeb Scraping FrameworkData EntryAPI IntegrationSeleniumScrapyMarket AnalysisMarket ResearchData AnalysisAmazon FBA Product ResearchAmazon API GatewayAmazon Product Research "
    },
    {
        "Name": "Data scraper",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-span-class-highlight-scraper-span_~021895060355585918819/?referrer_url_path=/nx/search/jobs/",
        "Task": "I WONT READ YOUR PROPOSAL IF ITS AI GENERATED OR A TEMPLATE.\n\nI'm looking for a fast and efficient data scraper to generate me a list of leads who are coaches that sell infoproducts or digital products. They should sell something £500+ and should be based within the United Kingdom.\n\nThis can be ideally relationship and dating coaches, health and wellness coaches etc. They can have digital products, mentoriship, coaching or a community.\n\nIdeally I want somebody who can be super thorough, as i have such a detailed criteria which we can talk about later. Preference is people that have done this before for the exact target market im looking for.\n\nI need the following information:\n-Company name\n-Decision maker name\n-Decision maker email\n-Decision maker linkedin\n- decision maker instragram\n\nDecision maker will be founder, ceo or managing director.\n\nThese coaches need to fit into a particular market and be for a specific area only.  but will explain more once we have a chat.\n\nYou must also be willing to provide a sample. and tell me a specific number of leads you can generate once i give you the search parameters.\n\nStart your response with 'email' if you have read this properly. Im looking for a list of 300 people. please apply if you can do this and in your application tell me how long this would take you and show previous work that you've completed.\n\nThanks!",
        "Skills_Expertise": " Data ScrapingData MiningData ExtractionData EntryMicrosoft Excel "
    },
    {
        "Name": "Freelancer Needed to Create Verified Contact Lists",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Freelancer-Needed-Create-Verified-Contact-Lists_~021895013320341802056/?referrer_url_path=/nx/search/jobs/",
        "Task": "We seek a skilled freelancer to create contact lists for electrician businesses in the Perth, Australia location. The contact lists must include:\n\nFirst Name\nLast Name\nEmail Address\nBusiness Name\n\nAll email addresses must be verified and tested for accuracy to ensure deliverability.\n\nResponsibilities\nResearch and identify businesses in the given niche and location.\nCollect and compile data for each contact, ensuring all required fields are complete.\nVerify and test email addresses to ensure they are valid and functional.\nDeliver a clean, accurate, and organized contact list in the specified format (e.g., Excel, Google Sheets).\n\nRequirements\nProven experience in creating and verifying business contact lists.\nFamiliarity with tools for email verification and testing.\nStrong attention to detail and data accuracy.\nAbility to meet deadlines and deliver high-quality work.\n\nKey Details\nFixed Price Quote: Please specify your rate for creating a list of 200 contacts.\nTurnaround Time: Let us know how long it will take to deliver.\nStart Date: Immediately\n\nIf you’re experienced in creating verified contact lists and can ensure quality and accuracy, we’d love to hear from you. \n\nPlease reply with:\nYour fixed price quote.\nEstimated completion time.\nA brief overview of your experience with similar tasks.",
        "Skills_Expertise": " Data EntryList BuildingProspect List "
    },
    {
        "Name": "Outreach Specialist for Mendix Low-Code Tool",
        "Fixed_price": "Hourly: $15.00 - $100.00",
        "Url": "https://www.upwork.com/jobs/Outreach-Specialist-for-Mendix-Low-Code-Tool_~021895058120071924808/?referrer_url_path=/nx/search/jobs/",
        "Task": "Job Title: Outreach Specialist for Mendix Low-Code Development Tool\n\nJob Description:\nWe are looking for an energetic and results-driven Outreach Specialist to expand our network of potential clients in the United States who could benefit from using Mendix, a leading low-code development platform.\n\nAs an Outreach Specialist, you will play a critical role in identifying and connecting with businesses, showcasing the advantages of adopting Mendix to streamline their software development processes. Your goal is to build relationships, generate interest, and create opportunities for our sales team.\n\nResponsibilities:\nConduct thorough research to identify potential client companies in the US market.\nInitiate contact with decision-makers through email, phone, and other channels.\nCommunicate the value proposition of Mendix as a low-code development tool.\nMaintain a database of leads and ensure accurate tracking of outreach activities.\nCollaborate with the sales and marketing teams to develop targeted outreach campaigns.\nProvide regular feedback on outreach strategies to optimize results.\n\nRequirements:\nProven experience in B2B outreach, preferably in the technology or software sector.\nStrong communication and interpersonal skills, with the ability to convey technical concepts in simple terms.\n\nProactive, self-motivated, and goal-oriented attitude.\nFamiliarity with low-code development tools or software development is a plus.\nExcellent organizational skills and attention to detail.\n\nWhat We Offer:\nCompetitive pay based on experience and performance.\nFlexible working hours with remote work opportunities.\nThe chance to be part of a dynamic team passionate about innovative technology.\nIf you are excited about connecting businesses with cutting-edge technology solutions and have the skills to thrive in this role, we’d love to hear from you!\n\nApply now and join us in promoting Mendix as the go-to low-code development platform!",
        "Skills_Expertise": " HTMLWeb DevelopmentJavaScriptWordPressMicrosoft Excel "
    },
    {
        "Name": "Browser Extension Developer (Chrome & Edge) - Selenium Integration",
        "Fixed_price": "Hourly: $10.00 - $20.00",
        "Url": "https://www.upwork.com/jobs/Browser-Extension-Developer-Chrome-Edge-Selenium-Integration_~021895055500334209067/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking a skilled and passionate Browser Extension Developer to join our team and play a crucial role in enhancing our Selenium-based automation applications. You will be responsible for developing and maintaining extensions for Chrome and Edge browsers, enabling seamless integration with our existing automation framework. This role requires a deep understanding of browser extension APIs, JavaScript, and a strong grasp of Selenium automation principles.\nResponsibilities:\n * Develop and maintain cross-browser extensions (Chrome & Edge) that interact with and enhance Selenium-driven applications.\n * Implement features that facilitate data extraction, UI manipulation, and interaction with web elements within the browser environment.\n * Optimize extension performance for efficiency and reliability in automated workflows.\n * Collaborate with QA and development teams to troubleshoot and resolve extension-related issues.\n * Write clean, well-documented, and testable code.\n * Stay up-to-date with the latest browser extension APIs and web development trends.\n * Integrate extensions with existing Selenium automation frameworks.\n * Implement and maintain secure coding practices.\n * Participate in code reviews and contribute to improving development processes.\nRequired Skills and Qualifications:\n * Proficiency in JavaScript, HTML, and CSS: Essential for building browser extensions.\n * Strong understanding of Chrome and Edge extension APIs: Including manifest files, content scripts, background scripts, and message passing.\n * Experience with Selenium WebDriver: Knowledge of how Selenium interacts with browsers and the ability to bridge the gap between extensions and Selenium.\n * Experience with asynchronous programming: Understanding Promises, async/await, and event-driven architectures.\n * Debugging and troubleshooting skills: Ability to identify and resolve issues in browser extensions and Selenium scripts.\n * Version control using Git: Familiarity with branching, merging, and pull requests.\n * Understanding of web security principles: Knowledge of CORS, CSP, and other security measures.\n * Experience with browser developer tools: Proficiency in using the Chrome/Edge DevTools for debugging and profiling.\n * Ability to write clear and concise technical documentation.\n * Strong problem-solving and analytical skills.\n * Excellent communication and collaboration skills.\nPreferred Skills:\n * Experience with TypeScript.\n * Familiarity with testing frameworks (e.g., Jest, Mocha).\n * Knowledge of browser automation tools beyond Selenium.\n * Experience with cross-browser compatibility testing.\n * Understanding of web scraping techniques.\n * Experience with packaging and deploying browser extensions.\n * Experience with building and interacting with REST APIs.",
        "Skills_Expertise": " Google Chrome ExtensionJavaJavaScriptAPISelenium WebDriverBrowser Automation "
    },
    {
        "Name": "Javascript Scrapfly Heroku Site Scraping Project",
        "Fixed_price": "Est. budget: $300.00",
        "Url": "https://www.upwork.com/jobs/Javascript-Scrapfly-Heroku-Site-span-class-highlight-Scraping-span-Project_~021895051300133017643/?referrer_url_path=/nx/search/jobs/",
        "Task": "We’re looking for a Web Scraping & Automation JS Engineer to expand existing web scraping framework across multiple e-commerce websites.\nYou’ll be working with a solid codebase that we’ve already built on Scrapfly API.\nWe need someone to adapt, deploy, and debug it for new sites while improving its efficiency.\n\nResponsibilities:\nAdapt & extend our existing web scraping framework for new sites.\nDeploy & maintain scrapers on Heroku\nDebug & optimize scraping performance, handling infinite scroll, JavaScript rendering, and anti-bot measures.\nImplement fixes & iterate on selectors, scrolling logic, and data extraction as sites evolve.\n\nWhat You’ll Need:\nProven experience with web scraping using Cheerio, Puppeteer, Selenium, or Scrapfly.\nStrong knowledge of JavaScript/Node.js and handling dynamic sites.\nExperience deploying scrapers to Heroku or similar cloud platforms.\nFamiliarity with MySQL (or similar databases) for data storage.\nAbility to debug quickly and iterate on failed scrapes.\n(Bonus) Experience handling CAPTCHAs, proxies, and anti-bot measures.\n\nInclude a relevant Github repo link",
        "Skills_Expertise": " Data ScrapingJavaScriptHerokuNode.jsAPI "
    }
]