[
    {
        "Name": "Open Source Contributor Needed for OAuth2 Authentication & Authorization",
        "Fixed_price": "Est. budget: $500.00",
        "Url": "https://www.upwork.com/jobs/Open-Source-Contributor-Needed-for-OAuth2-Authentication-Authorization_~021893487217610873510/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are looking for an experienced and passionate open-source contributor to assist with the development and enhancement of projects related to OAuth2 authentication and authorization. This role will primarily involve the following tasks:\n\nPull Request (PR) Reviews: Review incoming pull requests, ensuring adherence to coding standards, security best practices, and OAuth2-specific protocols.\nSolution Suggestions: Provide suggestions for improving existing solutions related to OAuth2 implementations.\n\nFeature Enhancements & Requests: Identify and propose new features or improvements that can be added to current projects in the OAuth2 space.\n\nCollaboration: Work closely with other open-source contributors and maintainers to ensure that all contributions align with the overall project goals.\n\nRequirements:\nStrong experience with OAuth2 and authentication/authorization protocols.\nFamiliarity with open-source contribution workflows (e.g., pull requests, issue tracking, and community engagement).\nProficiency in common programming languages used in OAuth2 implementations (e.g., Python, JavaScript, Go, Java, etc.).\nExperience with security best practices in authentication and authorization.\nAbility to review code, suggest improvements, and contribute new feature ideas.\nPrevious experience with open-source projects or contribution to OAuth2-related repositories (preferred).\n\nPreferred Skills:\nKnowledge of industry-standard authentication protocols (e.g., OAuth2, OpenID Connect).\nExperience with GitHub/GitLab/Bitbucket for version control and collaboration.\nStrong communication skills to engage with a distributed team.\n\nHow to Apply:\nPlease provide examples of your previous work with OAuth2, any open-source contributions you have made, and a brief overview of your experience working on authentication and authorization projects.",
        "Skills_Expertise": " GitBitbucketGitHubPythonAPIC#RESTful APIJavaNode.js "
    },
    {
        "Name": "Freelancer Needed to Create Verified Contact Lists",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Freelancer-Needed-Create-Verified-Contact-Lists_~021893486648926507215/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking a skilled freelancer to create contact lists for businesses within specific niches and locations. The contact lists must include:\n●\tFirst Name\n●\tLast Name\n●\tEmail Address\n●\tBusiness Name\nAll email addresses must be verified and tested for accuracy to ensure deliverability.\nResponsibilities\n●\tResearch and identify businesses in the given niche and location.\n●\tCollect and compile data for each contact, ensuring all required fields are complete.\n●\tVerify and test email addresses to ensure they are valid and functional.\n●\tDeliver a clean, accurate, and organized contact list in the specified format (e.g., Excel, Google Sheets).\nRequirements\n●\tProven experience in creating and verifying business contact lists.\n●\tFamiliarity with tools for email verification and testing.\n●\tStrong attention to detail and data accuracy.\n●\tAbility to meet deadlines and deliver high-quality work.\nKey Details\n●\tFixed Price Quote: Please specify your rate for creating a list of [insert approximate number of contacts, e.g., 100 contacts].\n●\tTurnaround Time: Let us know how long it will take to deliver.\n●\tStart Date: Immediate\nIf you’re experienced in creating verified contact lists and can ensure quality and accuracy, we’d love to hear from you. Please reply with:\n●\tYour fixed price quote.\n●\tEstimated completion time.\n●\tA brief overview of your experience with similar tasks.",
        "Skills_Expertise": " Data EntryList BuildingProspect List "
    },
    {
        "Name": "Data Expert Needed for Aftermarket Parts Analysis",
        "Fixed_price": "Hourly: $15.00 - $35.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Expert-Needed-for-Aftermarket-Parts-Analysis_~021893483757332957959/?referrer_url_path=/nx/search/jobs/",
        "Task": "Objective:\nWe are looking for a data specialist who can help us estimate the ratio of product page views to sales. Our goal is to determine how many views a product listing receives before a sale occurs, which will help us better forecast conversions for new product launches.\n\nScope of Work:\nData Collection:\n\nScrape website product pages to obtain page view counts (if available). We have given the web listings below.\nExtract available sales and/or review data for listed products.\nIdentify alternative data points if direct sales numbers are unavailable.\n\nData Analysis:\nUse a known industry assumption (5% review-to-sales ratio) to estimate product sales where actual sales data isn’t available.\nCalculate the average views-to-sales ratio for listed products.\nIdentify trends across product categories (motorcycle vs. UTV markets).\nWebsites & Products to Analyze:\n\nMotorcycle and UTV aftermarket parts from sites including SlingMods, Rocky Mountain ATV/MC, SuperATV, Lamonster Garage, and Can-Am Spyder Accessories.\nFull list of product links will be provided.\n\nDeliverables:\n\nA dataset or report outlining page views, estimated sales, and the derived views-to-sales ratio.\nInsights on data limitations and alternative methods for estimating conversion rates if scraping is restricted.\nAny additional observations that could refine our conversion forecasting model.\n\nThe links to the pages we'd like to use as our dataset:\nhttps://www.slingmods.com/canam-spyder-sequential-front-fender-led-reflectors-spyderfenderz-tricled-2019-up\nhttps://www.slingmods.com/polaris-slingshot-ultimat-mats?srsltid=AfmBOor7__wKCzbUHNzNOOw16TtT_hmtsIXUe_CsRi_kBOLurbMtxn8C\nhttps://www.slingmods.com/polaris-slingshot-v-back-canvas-roof-top-bullet-speed?search=Bullet%20Speed%20Vented%20Hood%20Insert%20for%20the%20Polaris%20Slingshot\nhttps://www.slingmods.com/canam-ryker-full-size-brake-pedal?search=Full%20Size%20Replacement%20Brake%20Pedal%20for%20the%20Can-Am%20Ryker\nhttps://www.canamspyderaccessories.com/show-chrome-rt-2020-and-up-seat-shock/\nhttps://www.canamspyderaccessories.com/show-chrome-rt-series-all-years-saddle-bags-soft-luggage-set-of-2/\nhttps://www.lamonstergarage.com/show-chrome-short-spiral-antenna-can-am-spyder/\nhttps://www.slingmods.com/polaris-slingshot-zero-g-roll-hoop-storage-bag-show-chrome?search=zero%20g\nhttps://www.rockymountainatvmc.com/parts/tusk-brake-lever-p\nhttps://www.rockymountainatvmc.com/parts/no-toil-pre-oiled-air-filter-p\nhttps://kombustionmotorsports.com/products/3-4-point-harness-seat-belt-50-caliber-racing\nhttps://www.rockymountainatvmc.com/parts/acerbis-replica-plastic-kit-p\nhttps://www.superatv.com/can-am-commander-2-5-lift-kit\nhttps://www.superatv.com/6000-lb-utv-atv-winch\nhttps://www.superatv.com/rgb-whip-lights",
        "Skills_Expertise": " Data EntryData AnalysisMicrosoft ExcelPython "
    },
    {
        "Name": "AI Agent Development with Unified Dashboard and Automation",
        "Fixed_price": "Est. budget: $500.00",
        "Url": "https://www.upwork.com/jobs/Agent-Development-with-Unified-Dashboard-and-Automation_~021893478623374366331/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking a talented freelancer to design an AI agent that integrates multiple applications into a single dashboard, enabling seamless connectivity and automation. The ideal candidate will have experience with AI technologies and dashboard development, ensuring that all applications work harmoniously together. The project requires creativity and technical expertise to automate processes efficiently. If you are passionate about AI and integration, we want to hear from you!",
        "Skills_Expertise": " Data ScrapingArtificial IntelligenceAPIAutomationn8nBot Development "
    },
    {
        "Name": "Web Scraping for Exercise Group Information",
        "Fixed_price": "Hourly: $3.00 - $8.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-for-Exercise-Group-Information_~021893476682490821929/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking a VA to extract information about existing exercise groups within specific council areas. I will share the wbesites where you can find these groups and I just need you to populate a spreadsheet with the info.",
        "Skills_Expertise": " Data ScrapingData EntryNotionLead Generation "
    },
    {
        "Name": "Data Aggregation + Extraction",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Aggregation-Extraction_~021893475989459407055/?referrer_url_path=/nx/search/jobs/",
        "Task": "We're looking to data aggregate the below industry lists:\nProperty stylists, \nInterior designers, \nArchitects, \nBuilders,\nDevelopers\n\nGeographically we'd like to focus on records within 50km of Sydney, Melbourne, Brisbane, Gold Coast, Byron Bay, Noosa, Sunshine Coast.\n\nI would be keen to understand more about your capabilities, expected investment, and the number of records we might expect. \n\nLook forward to hearing from you.",
        "Skills_Expertise": " Data ScrapingData MiningData EntryData ExtractionMicrosoft Excel "
    },
    {
        "Name": "Scrape Website for Directory and Email Information",
        "Fixed_price": "Est. budget: $80.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Scrape-span-Website-for-Directory-and-Email-Information_~021893475590552835707/?referrer_url_path=/nx/search/jobs/",
        "Task": "Description:\nI am looking for a freelancer to extract college counselor contact information from the website\nhttps://www.schooldirectory.org/\n\nProject Requirements:\nExtract the college counseling contact information for every school in the database.  [Note: If you go onto the website and visit the page for a given high school in the directory, and then scroll down, you come a section called: \"Academics\" which has \"College Counselor Info.\" I want to grab all that college counselor info!]\n\nFormat the data in an Excel sheet with the following columns:\nFirst Name\nMiddle Name\nLast Name\nEmail\nJob Title\nAny other relevant fields available in the directory\n\n****Ensure first, middle and last names are in separate columns for easy mail merge processing.*****\n\nDeliver the data in Excel and CSV format\n\nSkills Required:\nWeb scraping and automation (Python, BeautifulSoup, Scrapy, etc.)\nData extraction and formatting\nExperience with mail merge formatting in Google Sheets or Excel\nAttention to detail to ensure data accuracy\nPreferred Qualifications:\nPrior experience scraping membership directories\nAbility to automate the process for future updates\nFamiliarity with ethical scraping practices (ensuring compliance with NACAC's terms of service)\n\nBudget & Timeline:\nBudget: Open to proposals; expecting about $80 depending on complexity.\nTimeline: Preferably within 3 days.\n\nApplication Requirements:\nIn your proposal, please include:\nYour approach to extracting the data (automated scraping, manual entry, etc.).\nEstimated time for completion.\nExamples of similar projects you've worked on.\nLooking forward to working with a detail-oriented freelancer who can deliver clean, organized data for my email campaign",
        "Skills_Expertise": " Data ScrapingData MiningData Extraction "
    },
    {
        "Name": "Web Data Extraction & Reverse Engineering Specialist",
        "Fixed_price": "Hourly: $15.00 - $40.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Data-span-Extraction-amp-Reverse-Engineering-Specialist_~021893492352705649318/?referrer_url_path=/nx/search/jobs/",
        "Task": "I’m looking for a skilled developer to reverse engineer specific data from a few websites. The ideal candidate will have experience with web scraping, data extraction, and understanding site structures to retrieve relevant information efficiently. Familiarity with JavaScript, Python, and browser automation tools (e.g., Selenium, Puppeteer) is a plus. This is a short-term project with potential for ongoing work based on results.",
        "Skills_Expertise": " WordPressWeb DesignLanding PageWeb DevelopmentHTML "
    },
    {
        "Name": "Virtual Assistant for Outbound Email Prospecting and Lead Generation",
        "Fixed_price": "Hourly: $3.00 - $8.00",
        "Url": "https://www.upwork.com/jobs/Virtual-Assistant-for-Outbound-Email-Prospecting-and-Lead-Generation_~021893495474154103982/?referrer_url_path=/nx/search/jobs/",
        "Task": "About Us:\nUnalome Yoga, a growing yoga brand specializing in premium yoga products, is seeking a detail-oriented and motivated Virtual Assistant to help us with outbound email prospecting and lead generation. \n\nWhat You’ll Be Doing:\n - Research and compile a list of hot yoga studios in the U.S. \n - Send outreach emails to yoga studio owners/managers using provided templates, to identify potential wholesale partnership opportunities.\n - Track responses and follow up with leads using a CRM, Apollo or spreadsheet\n - Provide weekly updates on progress and results.\n\nKey Responsibilities:\n - Strong written communication skills in English.\n - Excellent research skills to identify yoga studios, and then dig deeper for primary emails for General Managers, Owners, Directors, Studio Managers, etc. \n - Detail-oriented with excellent organizational skills.\n - Ability to work independently and meet deadlines.\n - Familiarity with Google Sheets or Excel for tracking data\n\nBonus Skills (Not Required):\n - Interest in yoga, fitness, or wellness.\n - Experience working with e-commerce or product-based businesses.\n - Experience with email outreach or lead generation tools (e.g. Apollo.io)\n\nCompensation:\n - Hourly Rate: $3–$8/hour, depending on experience\n - Hours/Week: 5 - 10",
        "Skills_Expertise": " Data ScrapingData EntryLead GenerationEmail CommunicationProspect ListLead NurturingEmail MarketingList BuildingEmail Campaign Setup "
    },
    {
        "Name": "Web Scraping",
        "Fixed_price": "Hourly: $8.00 - $25.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span_~021893490568365183183/?referrer_url_path=/nx/search/jobs/",
        "Task": "Create a spreadsheet for wholesale suppliers of the following products in Australia:\n\nWholesale Egg Suppliers\nWholesale Packaged Seafood Suppliers\nWholesale Packaged Meat Suppliers\nWholesale Ready to Eat Meal Suppliers\nWholesale Food and Beverage Distributors\nWholesale Milk Suppliers\n\nBusiness Name\nBusiness Email\nBusiness Phone\nAccounting System used\nInventory System used\nOn Fresho platform yes/no\nOn Ordermentum platform yes/no\nNumber of Woolworths Australia Stores that stock this company's products\nKey Personell First Name (from LinkedIn)\nKey Personell Last Name (from LinkedIn)\n\nI need as many good quality entries as possible.",
        "Skills_Expertise": " Data ScrapingData MiningData ExtractionData EntryBeautiful SoupSeleniumPythonWeb CrawlingScrapy "
    },
    {
        "Name": "Website Scraping and Search Box Implementation Developer",
        "Fixed_price": "Est. budget: $100.00",
        "Url": "https://www.upwork.com/jobs/Website-span-class-highlight-Scraping-span-and-Search-Box-Implementation-Developer_~021893510197969049211/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking a highly responsive and versatile developer to assist in scraping data from a specific website. The project involves creating a search box that allows users to filter out irrelevant information from source site while making sekected data accessible. The ideal candidate must be responsive and can turn project around in 2 days - have experience with web scraping techniques and a strong understanding of user interface design. this is just a test to find a good long term developer to join my global team.",
        "Skills_Expertise": " Data ScrapingJavaScriptHTMLPHPPython "
    },
    {
        "Name": "DevOps/Infrastructure Engineer Needed for Web Scraping Deployment on GCP",
        "Fixed_price": "Hourly: $8.00 - $10.00",
        "Url": "https://www.upwork.com/jobs/DevOps-Infrastructure-Engineer-Needed-for-Web-span-class-highlight-Scraping-span-Deployment-GCP_~021893489213969895631/?referrer_url_path=/nx/search/jobs/",
        "Task": "Seeking a DevOps or Infrastructure Engineer for a consultation on deploying a web scraping script in a GCP cloud environment. \nThe script should run at regular intervals and store the results in cloud storage.",
        "Skills_Expertise": " Web ScrapingCI/CDDevOpsAutomation "
    }
]