[
    {
        "Name": "Data Extraction from hard Drives",
        "Fixed_price": "Est. budget: $100.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Extraction-from-hard-Drives_~021894457167039908936/?referrer_url_path=/nx/search/jobs/",
        "Task": "I'm seeking a professional data recovery service to salvage information from roughly ten non-functional internal desktop hard drives from the 90s and 2000s. The drives contain a mix of documents, spreadsheets, photos, videos, emails, and contacts.\n\nKey Requirements:\n- Expertise in data recovery from vintage hard drives\n- Ability to handle physically defective drives\n- Proficiency in retrieving various file formats\n- Capacity to store retrieved data in cloud storage\n\nThe ideal candidate will have experience in data retrieval from obsolete technology, and can assure the secure handling and shipment of the drives. Please provide evidence of previous similar projects when bidding.",
        "Skills_Expertise": " External Hard DriveStorage DeviceHelp Desk Technology International ServicePRO "
    },
    {
        "Name": "Data Collection Specialist for Colorado-Specific Contact Lists",
        "Fixed_price": "Est. budget: $500.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Collection-Specialist-for-Colorado-Specific-Contact-Lists_~021894454067206276963/?referrer_url_path=/nx/search/jobs/",
        "Task": "Project Overview:\nWe are seeking a detail-oriented Data Collection Specialist to compile comprehensive, Colorado-specific contact lists covering various categories such as conferences, schools, associations, and corporations. This is a temporary 40-hour project with a clear deliverable: clean, verified, and well-organized data delivered in a Google Sheet or CSV format.\n\nResponsibilities:\n\nData Research & Collection:\n\nIdentify and source reliable websites, directories, and public records specific to Colorado.\nManually research and verify contact details (e.g., names, emails, phone numbers, websites, addresses).\nWeb Scraping & Automation:\n\nUtilize Python (with libraries such as BeautifulSoup, Requests, Selenium, and Pandas) to automate the extraction of data from selected sources.\nDevelop scripts to handle pagination, extract detailed information, and format data for easy integration.\nData Cleaning & Organization:\n\nClean and structure the gathered data to ensure accuracy and consistency.\nOrganize the data into clearly labeled spreadsheets, categorizing by type (conferences, schools, associations, corporations).\nReporting & Communication:\n\nProvide regular updates on progress and flag any issues or challenges.\nDeliver the final data set along with your Python scripts and documentation of your process.\nRequirements:\n\nProven experience in web scraping and data collection.\nStrong proficiency in Python and its relevant libraries (BeautifulSoup, Requests, Selenium, Pandas).\nExcellent attention to detail with a commitment to data accuracy.\nAbility to work independently and communicate effectively.\nPrior experience with similar data collection projects is a plus.\nFamiliarity with Google Sheets and data integration is beneficial.\nProject Details:\n\nDuration: 40 hours (temporary project)\nLocation: Remote\nDeliverables:\nA detailed, verified list of Colorado-specific contacts for each category.\nClean, organized data in a Google Sheet or CSV format.\nPython scripts and documentation outlining the data collection and verification process.",
        "Skills_Expertise": " Data EntryData MiningData ScrapingMicrosoft ExcelLead GenerationList BuildingProspect List "
    },
    {
        "Name": "Video generator",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Video-generator_~021894448789093829704/?referrer_url_path=/nx/search/jobs/",
        "Task": "My name is Jay and I’m trying to create faceless content on tik tok about space and I needed someone to create the video part of it while I’ll create the script and voice over I would send that to you and you would turn the voice over into a realistic engaging video. I was thinking 5$ per video. Hope all is well. Please get back to me when your available",
        "Skills_Expertise": " Data ExtractionData ScrapingData EntryData MiningData VisualizationPythonSQLCanvaIBM Db2Customer ServiceSocial Media ManagementLead GenerationAdobe Premiere ProMicrosoft ExcelGoogle WorkspaceVirtual Assistance "
    },
    {
        "Name": "Data Collection from Facebook API in Lahore and Karachi",
        "Fixed_price": "Est. budget: $50.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Collection-from-Facebook-API-Lahore-and-Karachi_~021894447999896881927/?referrer_url_path=/nx/search/jobs/",
        "Task": "I am seeking a skilled and detail-oriented individual to assist with a project focused on analyzing gender-related interests through Facebook's Marketing API at the smallest geographic unit in Lahore and Karachi, Pakistan. The ideal candidate will have experience with data collection through APIs, and familiarity with how Pakistani firms use the Facebook marketing API. \n\n1 - Identify the Smallest Geographic Unit in Lahore:\n1A - Research and determine the most granular administrative unit in Lahore (e.g., neighborhood, union council, ward, or equivalent) that can be queried using the Facebook API \n1B - Provide a detailed explanation of this unit and how it aligns with Facebook's geo-targeting capabilities.\n\n2 - Data Collection through Facebook’s Marketing API:\n2A - Query Facebook’s Marketing API for each gender-related interest and for all relevant geographic units in Lahore and Karachi \n2B - Collect data on the number of monthly active users (MAU) 2C - Organize and deliver the data in a clear, structured format (e.g., spreadsheet or database).",
        "Skills_Expertise": " Data ExtractionAPIFacebook Advertising "
    },
    {
        "Name": "VA: Tech Savvy, Fast, Responsive and Proactive",
        "Fixed_price": "Hourly: $3.00 - $6.00",
        "Url": "https://www.upwork.com/jobs/Tech-Savvy-Fast-Responsive-and-Proactive_~021894445976070002731/?referrer_url_path=/nx/search/jobs/",
        "Task": "Looking for someone who can learn these technologies in this video.  It has to do with scraping and getting good at finding very specific data.\n\nHere is the video:\n(link removed)\n\nCheck it out and if this sounds like something you would enjoy doing, please let me know how much your best hourly rate, or weekly rate is to start doing this, full time.\n\nIf you are fast and efficient, then we can potentially talk about something long term but first we must know if this is a good fit.\n\nPlease submit a voice sample in response to watching the video and seeing if this is a good fit for you.\n\nLooking for value and someone long term.\n\nMust have no other jobs or obligations.\n\nMust be able to have the ability to work full time in California hours if you make it through the training process and if you are selected.\n\nLooking for Bright minded \"A\" players.  \n\nIf you are ambitious, ready to learn and ready to work really hard, then this is for you.  If this doesn't sound like something you would enjoy, then please do not apply.  \n\nThank you.",
        "Skills_Expertise": " Virtual Assistance "
    },
    {
        "Name": "Web Scraping Specialist for Automated Data Extraction from Job Boards",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-Specialist-for-Automated-span-class-highlight-Data-span-Extraction-from-Job-Boards_~021894445600369416235/?referrer_url_path=/nx/search/jobs/",
        "Task": "Description\nWe are looking for an experienced Octoparse expert to set up and maintain web crawlers for multiple German job boards. The initial task is to create and configure a reliable crawler for one website (your choice from our priority list). Upon successful completion, we will expand the scope to the remaining platforms.\n\nKey Responsibilities\n• Configure an Octoparse crawler capable of navigating and extracting data from one selected job board.\n• Ensure the crawler identifies and extracts the specified fields in a precise order.\n• Integrate daily data extraction results into our CRM through CSV exports (we handle the automation part).\n• Implement robust solutions for IP blocks and CAPTCHAs (we can provide tools such as 2captcha/0captcha and rotating proxies).\n• Deliver consistent, high-quality data and handle missing fields gracefully (leave them blank if not available).\n\nTarget Websites\nChoose any one to begin with (and then proceed to the others if successful):\n\nhttps://www.jobware.de/jobsuche\nhttps://stellenmarkt.swffm.de/\nhttps://de.jooble.org/\nhttps://jobninja.com/\nhttps://www.1a-stellenmarkt.de/\nData Fields (in order)\nCompany (Unternehmen)\nCustomer Type (Kundentyp)\nJob URL\nSource (Quelle)\nAdditional Info/Note (e.g. which position is open)\nStreet (Straße)\nPostal Code (PLZ)\nCity (Ort)\nCountry (Land)\nWebsite\nContact Person \nPhone Number \nE-Mail\n\nAdditionally, the crawler must search each of the German regions (Baden-Württemberg, Bayern, Berlin, Brandenburg, Bremen, Hamburg, Hessen, Mecklenburg-Vorpommern, Niedersachsen, Nordrhein-Westfalen, Rheinland-Pfalz, Saarland, Sachsen, Sachsen-Anhalt, Schleswig-Holstein, Thüringen)\n\nRequirements & Expectations\n• Proven experience web scraping, preferably on dynamic websites.\n• Familiarity with automation triggers for daily scraping tasks.\n• Ability to circumvent or handle IP restrictions, rate limits, and CAPTCHAs.\n• Deliver data in CSV format that will feed directly into our CRM.\n• Complete initial crawler setup within 1–2 weeks.\n• Willingness to adapt and expand to additional job boards once the first is working correctly.\n\nAdditional Notes\n• We have partial configurations from past attempts but have not been able to successfully crawl these sites. We need an specialist to troubleshoot and finalize the process.\n• Blank fields are acceptable if the data is truly unavailable. However, we strive to capture as many details as possible.\n• If you have recommendations to enhance data quality (e.g., advanced scheduling, proxy solutions, captcha-solving strategies), please include these in your proposal.\n\nWhat to Include in Your Proposal\n• A summary of your Scrapimg experience and relevant projects.\n• Outline of the approach and timeline for handling the first job board. (see in the list and choose your most fitting board)\n• Proposed method for dealing with dynamic pages, IP blocks, and CAPTCHAs.\n• Pricing and estimated delivery time for the initial setup, plus any separate fees for subsequent sites.\n\nWe look forward to receiving your proposal and working with a crawler expert who can deliver consistent, high-quality results on these job boards.\n\nSo what is the first Project Scope:\nYou will create a price offer for 1 Job Portal of your choice, like mention earlier.",
        "Skills_Expertise": " Data Scraping "
    },
    {
        "Name": "Email Scraper Needed for Data Collection",
        "Fixed_price": "Est. budget: $35.00",
        "Url": "https://www.upwork.com/jobs/Email-span-class-highlight-Scraper-span-Needed-for-span-class-highlight-Data-span-Collection_~021894442994346747054/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking an experienced email scraper to help us gather targeted email addresses for our Community Development Financial Institutions Fund for outreach. The ideal candidate will have a strong understanding of web scraping tools and techniques to extract data efficiently and accurately. You will be responsible for ensuring data quality and compliance with relevant regulations. If you're skilled in scraping emails from various sources and can provide results in a timely manner, we would love to hear from you.",
        "Skills_Expertise": " Data ScrapingData MiningData Entry "
    },
    {
        "Name": "Data Enrichment from Obituaries",
        "Fixed_price": "Hourly: $6.00 - $8.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Enrichment-from-Obituaries_~021894442823689538311/?referrer_url_path=/nx/search/jobs/",
        "Task": "Seeking a detail-oriented freelancer to:\n\n1. Extract information from recent obituaries\n2. Enhance this data with additional data (addresses, email addresses, phone numbers etc) \n\nYou will be provided with an exact workflow to follow.\n\nThe ideal candidate will have a strong background in data research and very detail focused. \n\nThis role requires excellent attention to detail and the ability to work independently. \n\nWe expect to kick off the project asap. \n\nThis is a full time, short term project (expect full time- 40 hours a week) for about a month.",
        "Skills_Expertise": " Data EntryData MiningData Scraping "
    },
    {
        "Name": "Develop a Custom Lead-Generating Marketing Application",
        "Fixed_price": "Est. budget: $150.00",
        "Url": "https://www.upwork.com/jobs/Develop-Custom-Lead-Generating-Marketing-Application_~021894461117989787691/?referrer_url_path=/nx/search/jobs/",
        "Task": "Build a Web-Based Lead Generation & Automated Outreach Tool\n\nJob Summary:\nI am looking for a skilled software developer to build a custom web-based marketing application that automates lead generation and outreach for SEO and web development services. I have a video that will show you what I want. The application should be able to:\n\n✅ Extract thousands of domains based on entered keywords.\n✅ Scan websites for coding errors, search engine rankings, and primary keywords.\n✅ Generate detailed reports outlining issues and suggested services.\n✅ Automatically send reports via email to website owners.\n✅ Capture responses from interested clients and forward them for service fulfillment.\n✅ Support bulk processing with mass email functionality.\n\nCore Features & Functionalities:\n\nKeyword-Based Domain Extraction:\n\n-User enters a list of keywords, and the tool scrapes relevant domain names.\n\nWebsite Analysis & Error Detection:\n\n-Automatically scans each domain for coding issues, SEO weaknesses, and search engine rankings.\n\nReport Generation & Email Outreach:\n\n-Prepares short reports highlighting identified issues.\nSends automated emails with the reports to website owners.\n\nLead Management & Forwarding:\n\n-Captures responses from interested clients.\nAllows easy forwarding of inquiries to external service providers.\n\nMass Email Capability:\n\n-Enables bulk sending of reports to multiple domains at once.\n\nUser Dashboard:\n\n-Simple web interface for entering keywords, managing reports, and tracking responses.\n\nIdeal Candidate:\n-Strong experience in web scraping and automation.\n-Proficiency in backend development (Python, Node.js, PHP, or similar).\n-Experience with email automation (SMTP, APIs like SendGrid, Mailgun).\n-Ability to build simple dashboards with simple UI/UX.\n-Familiarity with SEO tools and website auditing software is a plus.\n\n-Deliverables:\n✅ Fully functional web-based marketing application hosted on my server.\n✅ Complete source code with proper documentation.\n✅ Integration with email APIs for automated report delivery.\n✅ Basic user interface to operate the tool with minimal technical expertise.\n✅ Testing & debugging to ensure smooth operation.\n\nBudget & Timeline:\n-Open to proposals but expect delivery within 3-6 weeks.\n-Will discuss additional features.\n\nHow to Apply:\n-Share relevant projects where you have built similar automation tools.\n-Outline your approach to building this application and preferred technologies.\n-Provide an estimated cost and timeline for project completion.\n\nLooking forward to working with a talented developer to bring this tool to life! 🚀",
        "Skills_Expertise": " Data ScrapingWeb Application DevelopmentAutomationAPI IntegrationScripting "
    },
    {
        "Name": "Research & Deal Sourcing Assistant for Business Acquisitions",
        "Fixed_price": "Hourly: $3.00 - $15.00",
        "Url": "https://www.upwork.com/jobs/Research-Deal-Sourcing-Assistant-for-Business-Acquisitions_~021894444146917549381/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are dedicated to acquiring and growing exceptional small to medium-sized businesses in the US market. We are looking for a highly organized, detail-oriented, and proactive assistant to help with sourcing small business acquisition opportunities, conducting industry research, reaching out to business owners, and creating professional presentations.\n\nThe ideal candidate has exceptional English verbal and written skills, strong research abilities, and experience with ChatGPT and automation tools to improve efficiency. You should also be able to summarize findings in clear, polished PowerPoint presentations.\n\nResponsibilities:\n1. Deal Sourcing\nMonitor business-for-sale platforms daily (BizBuySell, Axial, BizQuest, etc.).\nScreen listings based on specific investment criteria.\nRequest and review Confidential Information Memorandums (CIMs).\nManage NDAs and organize deal-related documents.\nKeep our deal tracking system updated.\nProvide weekly reports on deal pipeline progress.\n\n2. Industry Research\nConduct market research to evaluate industries and identify attractive investment opportunities.\nSummarize key insights, trends, and opportunities.\nPresent findings in clear, well-structured PowerPoint presentations.\n\n3. Outreach to Business Owners\nIdentify and reach out to small business owners who may be open to selling.\nDraft and send professional, persuasive emails.\nMaintain outreach records and follow up consistently.\nCommunicate professionally and confidently with business owners.\n\n4. Automation & AI Efficiency\nUse ChatGPT and other GenAI tools to streamline tasks such as deal analysis and email drafting.\nSet up web scraping and email automation tools to improve efficiency.\nOptimize workflows to save time and increase effectiveness.\n\n5. Presentation & Reporting\nCompile research and deal insights into professional PowerPoint presentations.\nCreate visually appealing summaries and key takeaways for internal decision-making.\nEnsure presentations are clear, polished, and well-structured.\n\nRequirements:\nExceptional English verbal and written communication skills (a must).\nStrong research and analytical abilities.\nExperience with business acquisition platforms (a plus but not required).\nProficiency in PowerPoint (must be able to create executive-level presentations).\nExperience with ChatGPT and automation tools (e.g., web scraping, email sequencing).\nVery high attention to detail, organized, and proactive.\nWe will be available to teach you most of the industry specific knowledge to help you perform the tasks.\n\nPreferred Skills (Nice to Have):\nExperience in M&A, private equity, or business brokerage.\nFamiliarity with CRMs or deal-tracking software.\nBasic knowledge of financial statements.\n\nThis is a long-term role with opportunities for growth. If you are detail-oriented, tech-savvy, and excited about deal sourcing, industry research, and presenting insights professionally, I’d love to hear from you!",
        "Skills_Expertise": " Data EntryMicrosoft PowerPointChatGPTEmail CommunicationFile ManagementPresentationsMarket ResearchLead GenerationAdministrative Support "
    },
    {
        "Name": "Sales lead generation by Web research and data mining",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Sales-lead-generation-Web-research-and-span-class-highlight-data-span-mining_~021894463652347946309/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are based in Vienna, we are searching for someone who helps us with lead generation,  in the sense of market search to find possible customer.\n\nI think it is better to have a call.",
        "Skills_Expertise": " Data EntryData MiningMicrosoft ExcelMicrosoft WordOnline ResearchCompany ResearchTopic ResearchGeneral TranscriptionSales Lead ListsDatabaseLead Generation "
    },
    {
        "Name": "Process unstructured data",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Process-unstructured-span-class-highlight-data-span_~021894465472877807459/?referrer_url_path=/nx/search/jobs/",
        "Task": "Hello!\nI would like to know if you can do a certain job for me. \nIn a project that I have for my master degree I need to build an automated process using Uipath. I want to demonstrate via uipath a method to process unstructured data in the credit approbation process. \n\nUsing OCR, NLP, RPA and IDP , I need you to do a simple demo with the method i will give you.",
        "Skills_Expertise": " Data ExtractionData ScrapingBusiness Process AutomationAutomation AnywhereBlue PrismVisual Basic for ApplicationsUiPathAutomationRobotic Process AutomationAutomated WorkflowC#JavaScriptBusiness Analysis "
    }
]