[
    {
        "Name": "Web Scraping Expert Needed to Extract Data from Website",
        "Fixed_price": "Est. budget: $50.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-Expert-Needed-Extract-span-class-highlight-Data-span-from-Website_~021893806334303164027/?referrer_url_path=/nx/search/jobs/",
        "Task": "Description:\nWe are looking for an experienced web scraper to extract specific data from a website and deliver it in a structured format (CSV, Excel, or Google Sheets). The ideal candidate should be skilled in web scraping techniques, proficient in Python (BeautifulSoup, Scrapy, or Selenium), and able to automate the process efficiently.\n\nProject Requirements:\nScrape data from [insert website URL]\nExtract fields including [list specific fields: e.g., company name, contact info, pricing, product details, etc.]\nDeliver data in [CSV/Excel/Google Sheets/Database]\nEnsure accuracy, deduplication, and proper formatting\nImplement a script that can be re-run in the future if needed\nAvoid bot detection and handle CAPTCHAs if necessary\nSkills Required:\nWeb scraping (BeautifulSoup, Scrapy, Selenium, or Puppeteer)\nPython or another scripting language\nData cleaning and processing\nHandling dynamic websites and pagination\nAdditional Information:\nLet us know if you have prior experience scraping similar websites\nPlease include examples of past scraping projects\nEstimated turnaround time for this project\nLooking forward to working with a skilled freelancer who can efficiently extract and organize the required data.",
        "Skills_Expertise": " Data ScrapingData ExtractionData MiningPython "
    },
    {
        "Name": "B2B Lead Generation & Email List Specialist",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/B2B-Lead-Generation-Email-List-Specialist_~021893804625294809766/?referrer_url_path=/nx/search/jobs/",
        "Task": "Hello, and thank you for your interest in this job!\n\nWe are looking for a B2B lead generation specialist to help us build high-quality, verified contact lists for commercial clients. The task involves researching and compiling targeted business leads, including emails and phone numbers, with a focus on accuracy and compliance.\nWhat We Expect from You:\nDeliverables: A well-organized list of targeted leads (including Name, Company, Title, Email, Phone, Website, LinkedIn, etc.) in Google Sheets.\nSkills Required: Experience with B2B lead generation, email verification, data scraping, and tools like Apollo.io, ZoomInfo, and LinkedIn Sales Navigator.\nCommunication: We value clear, prompt communication and will be available for updates, feedback, and questions via Upwork messages, email, or scheduled check-ins.\nWork Style: We prefer an organized, deadline-driven approach with regular progress updates. If the quality meets our expectations, this can turn into an ongoing partnership.\nIf this sounds like a good fit for you, please apply with:\n\nA sample lead list you’ve built before (dummy data for confidentiality is fine).\nThe tools and methods you use for lead generation and verification.\nYour expected cost per [X number] of leads and turnaround time.\nLooking forward to working with you! 🚀",
        "Skills_Expertise": " Data ScrapingData MiningData EntryLead Generation StrategyLead GenerationProspect ListList BuildingEmail MarketingB2B MarketingMarket Research "
    },
    {
        "Name": "Expert Lead Extractor/Scraper for High-Quality Lead Generation",
        "Fixed_price": "Hourly: $10.00 - $30.00",
        "Url": "https://www.upwork.com/jobs/Expert-Lead-Extractor-span-class-highlight-Scraper-span-for-High-Quality-Lead-Generation_~021893801944623190223/?referrer_url_path=/nx/search/jobs/",
        "Task": "Job Description:\nAre you a skilled lead extraction specialist with a knack for finding needles in the digital haystack? We’re looking for a detail-oriented, tech-savvy professional to join our team and help us build a robust pipeline of targeted leads. If you thrive on turning data into actionable opportunities, this role is for you!\n\nWhat You’ll Do:\n\nExtract high-quality leads from platforms like LinkedIn, industry directories, websites, and databases.\n\nUse tools (e.g., Apollo, Hunter.io, Scrapy, or custom scripts) to scrape and verify contact details (emails, phone numbers, social profiles).\n\nOrganize leads into structured formats (CSV/Excel) with accuracy and attention to detail.\n\nEnsure compliance with data privacy laws (GDPR, CCPA) and ethical scraping practices.\n\nCollaborate with our sales/marketing team to refine targeting criteria for ideal customer profiles (ICP).\n\nWe’re Looking For Someone Who:\n\nHas proven experience in lead generation, data scraping, or web research.\n\nIs proficient with tools like LinkedIn Sales Navigator, PhantomBuster, Octoparse, or similar.\n\nUnderstands CRM systems (HubSpot, Salesforce) and data cleaning best practices.\n\nCommunicates clearly, meets deadlines, and adapts to evolving project needs.\n\nBonus: Experience in [insert your industry, e.g., SaaS, real estate, e-commerce].\n\nWhy Work With Us?\n\nCompetitive Pay: We value your expertise and offer attractive hourly/fixed rates.\n\nFlexible Hours: Work remotely on a schedule that suits you.\n\nLong-Term Opportunity: Potential for ongoing projects based on performance.\n\nSupportive Team: Collaborate with a growth-driven team that values your input.\n\nHow to Apply:\nSubmit a proposal with:\n\nExamples of past lead extraction projects (e.g., sample datasets or tools used).\n\nYour preferred tools/methods for scraping and verifying leads.\n\nYour availability and estimated timeline for delivering 1,000–5,000 leads.\n\nReady to help us unlock growth? Let’s connect!",
        "Skills_Expertise": " Data ScrapingData MiningData ExtractionData CleaningList BuildingLead GenerationLead Generation StrategyProspect ListMarket ResearchWeb Crawling "
    },
    {
        "Name": "Lead Generation Specialist (Linkedin)",
        "Fixed_price": "Hourly: $3.00 - $5.00",
        "Url": "https://www.upwork.com/jobs/Lead-Generation-Specialist-Linkedin_~021893898213259853097/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are looking for 2 Lead Generation (Linkedin) specialists who can perform the following daily tasks for our outreach campaigns.\n\n1) Scrape the LinkedIn jobs for assigned keywords and research the hiring manager.\n2) Create a list with the email/phone of the hiring manager along with the job title.\n3) Run the collected email through the zero bounce or similar tool.\n4) Share a clean verified emails/phone/lead name/lead title/job title\n\nThis is an ongoing project for someone who can deliver quality leads daily.\n\nLooking forward to the application.\nRegards\nRJ",
        "Skills_Expertise": " Data ScrapingLead GenerationList Building "
    },
    {
        "Name": "Data Scraper Needed for Market Research",
        "Fixed_price": "Hourly: $3.00 - $8.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-span-class-highlight-Scraper-span-Needed-for-Market-Research_~021893885423398181542/?referrer_url_path=/nx/search/jobs/",
        "Task": "We are seeking an experienced data scraper to help us gather information from various online sources for market research purposes. The ideal candidate will have a strong background in web scraping, data extraction, and data management. You will be responsible for creating and maintaining scraping scripts, ensuring data accuracy, and delivering clean datasets on time. Familiarity with Python, Beautiful Soup, and data cleaning tools is essential. If you are detail-oriented and have a passion for data, we want to hear from you!",
        "Skills_Expertise": " Data ScrapingData MiningMicrosoft Excel "
    },
    {
        "Name": "Data Mining of Old WhatsApp Messages",
        "Fixed_price": "Hourly: $5.00 - $12.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Mining-Old-WhatsApp-Messages_~021893898161446344315/?referrer_url_path=/nx/search/jobs/",
        "Task": "I am seeking a skilled freelancer to assist with data mining my old WhatsApp messages. The ideal candidate will extract and organize important information, conversations, and media from my chat history. This project requires attention to detail and familiarity with WhatsApp's data structure. Your expertise will help me retrieve valuable insights from my past communications efficiently.",
        "Skills_Expertise": " Data EntryData MiningData ScrapingPythonMicrosoft Excel "
    },
    {
        "Name": "Web Scraping Consultant/Developer needed for web scraping and data management",
        "Fixed_price": "Hourly: $8.00 - $35.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-Consultant-Developer-needed-for-web-span-class-highlight-scraping-span-and-span-class-highlight-data-span-management_~021893891392580980943/?referrer_url_path=/nx/search/jobs/",
        "Task": "I am looking for a skilled web scraper to extract data from a specific website and store it locally for later query using keyword searches. The ideal candidate should have experience with web scraping tools and techniques, and formatting scraped data correctly both locally and with web hosting.  If you have a proven track record in web scraping and data management, I would love to hear from you.\n\n-----------------------------------------\n\nGOAL\nExtract data from a specific public website and store it locally for me to access and query at my convenience. The website contains \"Projects\" and variables that can be indexed to each project. Each \"Project\" also has a varying number of PDF documents that can be downloaded. I want the PDF documents downloaded and converted to text so that I can run keyword searches, and have document names and their associated project returned to me.\n\n---------------------------------------------------------------------------\n\nData indexing\nEvery project will have designations for:\n\nProject name (example = D/2015/1134/C)\nAddress\nApplication\nDescription\nEstimated cost\nLodged date\nDecision\nDecision data\nDecision by\n\nEvery project will also have PDF documents. For each document I want:\nMatching project name\nDocument title\nDocument text (I want all the text in a document converted into readable text that can be queried in the future)",
        "Skills_Expertise": " Web ScrapingData ScrapingData MiningData EntryData ExtractionPythonWeb CrawlingSQLScrapy "
    },
    {
        "Name": "Web Automation Need python expert.",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Web-Automation-Need-python-expert_~021893890057214909094/?referrer_url_path=/nx/search/jobs/",
        "Task": "I am looking for a developer to automate manually doing task. Without geting banned on website.\n\n\nApi integration \nPython expert \nNetwork (ip / proxy) expert",
        "Skills_Expertise": " Vulnerability AssessmentSecurity Assessment & TestingPenetration TestingNetwork SecurityInformation SecurityGoogle Cloud PlatformPythonJavaAmazon Web ServicesPostgreSQL ProgrammingMicrosoft AzureAPI TestingCloud SecurityWebsite SecurityDevOps "
    },
    {
        "Name": "No-Code/Low-Code Chatbot with Automated Data Scraping for Swiss Clinics",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Code-Low-Code-Chatbot-with-Automated-span-class-highlight-Data-span-span-class-highlight-Scraping-span-for-Swiss-Clinics_~021893887885236867279/?referrer_url_path=/nx/search/jobs/",
        "Task": "Job Description:\nWe need to develop a chatbot for several private medical clinics in Switzerland. The chatbot should answer user questions about doctors (specialties, contact details, etc.). However, the relevant information is spread across multiple clinic websites with different structures, no sitemaps, and pagination (“Next” buttons) that make automated crawling difficult. Our current no-code chatbot platform can’t properly scrape these sites.\n\nWhat We’re Looking For:\n\t1.\tData Scraping/Extraction: A reliable way (preferably no-code/low-code or minimal coding) to gather all necessary data (doctors, specialties, contact info) from each clinic’s site.\n\t2.\tData Maintenance: A solution to keep this information updated in case the website content changes.\n\t3.\tChatbot Integration: Once the data is gathered, we want to integrate it into a user-friendly chatbot (embedded on a landing page) that can immediately respond with the right doctor/clinic info.\n\nScope & Requirements:\n\t•\tWe welcome suggestions for no-code SaaS tools or low-code scripts.\n\t•\tThe main challenge is dealing with complex site structures (no sitemap, multiple pagination levels).\n\t•\tWe want the chatbot to be easy for end-users to query and for us to maintain.\n\nPlease include in your proposal:\n\t•\tYour suggested approach (tools, workflows, or platforms).\n\t•\tImplementation plan and estimated timeline.\n\t•\tRough cost or pricing model.\n\nThank you! We look forward to finding the right expert to help us.",
        "Skills_Expertise": " Chatbot DevelopmentArtificial IntelligenceChatbotBot DevelopmentTwilio APIAutomationSocial Media ChatbotAI ChatbotChatbot IntegrationChatbot TuningGPT ChatbotMachine LearningGenerative AIAPI DevelopmentDialogflow "
    },
    {
        "Name": "Data Mining and Data Entry",
        "Fixed_price": "Hourly: $5.00 - $10.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Mining-and-span-class-highlight-Data-span-Entry_~021893881043479793871/?referrer_url_path=/nx/search/jobs/",
        "Task": "Research. Data mining, scrapping and data input of data into online database.   Initially, this is a full-time project for several weeks.  Then, it becomes a part-time project with monthly information update maintenance and adjustment.  \n\nMust have solid English language knowledge",
        "Skills_Expertise": " Data EntryData MiningData ScrapingList BuildingOnline ResearchGoogle Docs "
    }
]