[
    {
        "Name": "Спеціаліст свинцю (LinkedIn)",
        "Fixed_price": "Hourly: $3.00 - $5.00",
        "Url": "https://www.upwork.com/jobs/Lead-Generation-Specialist-Linkedin_~021893898213259853097/?referrer_url_path=/nx/search/jobs/",
        "Task": "Ми шукаємо 2 фахівців покоління свинцю (LinkedIn), які можуть виконувати наступні щоденні завдання для наших пропагандистських кампаній.\n\n1) Скреб завдання LinkedIn для призначених ключових слів та дослідження менеджера з найму.\n2) Створіть список із електронною поштою/телефоном менеджера з найму разом із заголовком завдання.\n3) Запустіть зібраний електронний лист через нульовий відскок або подібний інструмент.\n4) Поділіться чистими перевіреними електронними листами/телефоном/іменем свинцю/заголовком свинцю/заголовком завдання\n\nЦе постійний проект для того, хто може щодня доставляти якісні потенційні клієнти.\n\nЗ нетерпінням чекаємо програми.\nПобажання\nRJ",
        "Skills_Expertise": "Будівля списків ScrapingLead GenerationList"
    },
    {
        "Name": "Скребок даних, необхідний для дослідження ринку",
        "Fixed_price": "Hourly: $3.00 - $8.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-span-class-highlight-Scraper-span-Needed-for-Market-Research_~021893885423398181542/?referrer_url_path=/nx/search/jobs/",
        "Task": "Ми шукаємо досвідченого скрепера даних, який допоможе нам зібрати інформацію з різних онлайн -джерел для досліджень ринку. Ідеальний кандидат матиме сильний досвід у веб -скребті, вилученні даних та управлінні даними. Ви несете відповідальність за створення та підтримку скребкових сценаріїв, забезпечення точності даних та доставки чистих наборів даних. Ознайомлення з Python, красивим супом та інструментами для очищення даних є важливим. Якщо ви орієнтовані на деталі та захоплюєтесь даними, ми хочемо почути від вас!",
        "Skills_Expertise": "Дані scrapingdata miningmicrosoft excel"
    },
    {
        "Name": "Обробка даних старих повідомлень WhatsApp",
        "Fixed_price": "Hourly: $5.00 - $12.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Mining-Old-WhatsApp-Messages_~021893898161446344315/?referrer_url_path=/nx/search/jobs/",
        "Task": "Я шукаю кваліфікованого фрілансера, який допомагає з видобутку даних моїх старих повідомлень WhatsApp. Ідеальний кандидат буде витягувати та організовувати важливу інформацію, розмови та ЗМІ з моєї історії чатів. Цей проект вимагає уваги до деталей та ознайомлення зі структурою даних WhatsApp. Ваша експертиза допоможе мені ефективно отримати цінні відомості з моїх минулих комунікацій.",
        "Skills_Expertise": "Дані entryData miningdata scrapingpythonmicrosoft excel"
    },
    {
        "Name": "Консультант/розробник веб -скребка, необхідний для веб -скребта та управління даними",
        "Fixed_price": "Hourly: $8.00 - $35.00",
        "Url": "https://www.upwork.com/jobs/Web-span-class-highlight-Scraping-span-Consultant-Developer-needed-for-web-span-class-highlight-scraping-span-and-span-class-highlight-data-span-management_~021893891392580980943/?referrer_url_path=/nx/search/jobs/",
        "Task": "Я шукаю кваліфікований веб -скребок, щоб витягнути дані з певного веб -сайту та зберігати їх локально для подальшого запиту за допомогою пошуку ключових слів. Ідеальний кандидат повинен мати досвід роботи з інструментами та методами скребка веб -сайтів, а також форматуванням даних, що скручують правильно, як локально, так і з веб -хостингом.  Якщо у вас є перевірений досвід роботи в веб -скребті та управлінні даними, я хотів би почути від вас.\n\n---------------------------------------\n\nЦіль\nВитягніть дані з певного загальнодоступного веб -сайту та зберігайте їх локально для доступу та запиту на мою зручність. Веб -сайт містить \"проекти\" та змінні, які можна індексувати до кожного проекту. Кожен \"проект\" також має різну кількість документів PDF, які можна завантажити. Я хочу, щоб документи PDF завантажувались та перетворили на текст, щоб я міг запустити пошук ключових слів та повернути назви документів та пов'язаний з ними проект.\n\n------------------------------------------------- ---------------------------\n\nІндексація даних\nКожен проект матиме позначення для:\n\nНазва проекту (Приклад = D/2015/1134/c)\nАдреса\nЗастосування\nОпис\nОрієнтовна вартість\nПосилена дата\nРішення\nДані про рішення\nРішення\n\nКожен проект також матиме PDF -документи. Для кожного документа, який я хочу:\nВідповідність назви проекту\nНазва документа\nТекст документа (я хочу весь текст у документі, перетвореному на читабельний текст, який можна запитати в майбутньому)",
        "Skills_Expertise": "Веб -scrapingdata scrapingdata miningdata entrydata extractionpythonweb crawlingsqlscrapy"
    },
    {
        "Name": "Веб -автоматизація потребує експерта Python.",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Web-Automation-Need-python-expert_~021893890057214909094/?referrer_url_path=/nx/search/jobs/",
        "Task": "Я шукаю розробника для автоматизації завдання вручну. Без заборони на веб -сайті.\n\n\nІнтеграція API \nЕксперт Python \nЕксперт мережі (IP / проксі)",
        "Skills_Expertise": "Оцінка вразливості"
    },
    {
        "Name": "Chatbot без коду/низького коду з автоматизованим вискоблюванням даних для швейцарських клінік",
        "Fixed_price": "Hourly",
        "Url": "https://www.upwork.com/jobs/Code-Low-Code-Chatbot-with-Automated-span-class-highlight-Data-span-span-class-highlight-Scraping-span-for-Swiss-Clinics_~021893887885236867279/?referrer_url_path=/nx/search/jobs/",
        "Task": "Опис роботи:\nНам потрібно розробити чат для кількох приватних медичних клінік у Швейцарії. Chatbot повинен відповісти на запитання користувачів про лікарів (спеціальності, контактні дані тощо). Однак відповідна інформація розповсюджується на декількох веб -сайтах клініки з різними структурами, без карт сайту та кнопки \"наступних\", які ускладнюють автоматичне повзання. Наша поточна платформа Chatbot No-Code не може належним чином вискочити ці сайти.\n\nЩо ми шукаємо:\n\t1. Скреб/вилучення даних: надійний спосіб (бажано без коду/низького коду або мінімальне кодування) для збору всіх необхідних даних (лікарів, спеціальностей, контактна інформація) з сайту кожної клініки.\n\t2. Підтримка даних: рішення для того, щоб ця інформація була оновлена ​​у випадку зміни вмісту веб -сайту.\n\t3. Інтеграція Chatbot: Після того, як дані зібрані, ми хочемо інтегрувати їх у зручний для користувача чат (вбудований на цільову сторінку), який може негайно відповісти з правою інформацією про лікаря/клініки.\n\nОбсяг та вимоги:\n\t• Ми вітаємо пропозиції для інструментів SaaS без коду або сценаріїв з низьким кодом.\n\t• Основним завданням є боротьба зі складними структурами сайту (без марки сайту, декілька рівнів Pagition).\n\t• Ми хочемо, щоб чат був легким, щоб кінцеві користувачі запитували та нас підтримувати.\n\nБудь ласка, включіть у свою пропозицію:\n\t• запропонований ваш підхід (інструменти, робочі процеси або платформи).\n\t• План впровадження та розрахунковий часовий графік.\n\t• Модель приблизних витрат або ціноутворення.\n\nДякую! Ми з нетерпінням чекаємо пошуку потрібного експерта, який допоможе нам.",
        "Skills_Expertise": "Chatbot Developmentartificial IntelligenceChatbotBot Developmenttwilio apiautomationsocial Media Chatbotai Chatbotchatbot IntegrationChatbot tuninggpt Chatbotmachine Learning Generative AIAPI Розробкадіалог Flow"
    },
    {
        "Name": "Обробка даних та введення даних",
        "Fixed_price": "Hourly: $5.00 - $10.00",
        "Url": "https://www.upwork.com/jobs/span-class-highlight-Data-span-Mining-and-span-class-highlight-Data-span-Entry_~021893881043479793871/?referrer_url_path=/nx/search/jobs/",
        "Task": "Дослідження. Обробка даних, скасування та введення даних даних в онлайн -базу даних.   Спочатку це проект на повний робочий день протягом декількох тижнів.  Потім він стає неповним проектом із щомісячним обслуговуванням та коригуванням оновлення інформації.  \n\nПовинно мати міцні знання англійської мови",
        "Skills_Expertise": "Data entryData miningdata scrapinglist buildingline researchgoogle docs"
    }
]